renesas/iot-reference-rx/Projects/aws_ether_ck_rx65n/e2studio_ccrx/src/smc_gen/r_fwup/src/r_fwup.c
/*
 * API
 */
/**********************************************************************************************************************
 * Function Name: R_FWUP_Open
 * Description  : Open r_fwup module
 * Arguments    : None
 * Return Value : FWUP_SUCCESS
 *                FWUP_ERR_FLASH
 *********************************************************************************************************************/
e_fwup_err_t R_FWUP_Open(void)
{
    /* Open internal flash */
    if (FWUP_SUCCESS != r_fwup_wrap_flash_open())
    {
        return (FWUP_ERR_FLASH);
    }

    s_image_size = 0;
    s_initial_rcv_flg = 0;
    //s_img_header_write_flg = 0;
    s_prg_list_write_flg = 0;
    s_img_prog_write_flg = 0;

    s_wrote_counter = 0;

#if (FWUP_CFG_UPDATE_MODE == FWUP_SINGLE_BANK_W_BUFFER_EXT)
    /* Open external flash */
    if (FWUP_SUCCESS != r_fwup_wrap_ext_flash_open())
    {
        return (FWUP_ERR_FLASH);
    }
#endif /* (FWUP_CFG_UPDATE_MODE == FWUP_SINGLE_BANK_W_BUFFER_EXT) */

    return (FWUP_SUCCESS);
}
/**********************************************************************************************************************
 End of function R_FWUP_Open
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_FWUP_Close
 * Description  : Close r_fwup module
 * Arguments    : None
 * Return Value : None
 *********************************************************************************************************************/
void R_FWUP_Close(void)
{
    /* Close internal flash */
    r_fwup_wrap_flash_close();

#if (FWUP_CFG_UPDATE_MODE == FWUP_SINGLE_BANK_W_BUFFER_EXT)
    /* Close external flash */
    r_fwup_wrap_ext_flash_close();
#endif /* (FWUP_CFG_UPDATE_MODE == FWUP_SINGLE_BANK_W_BUFFER_EXT) */
}
/**********************************************************************************************************************
 End of function R_FWUP_Close
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_FWUP_IsExistImage
 * Description  : Check existing image program
 * Arguments    : area    : FWUP_AREA_MAIN/FWUP_AREA_BUFFER
 * Return Value : true    : image program is found
 *                false   : image program is not found
 *********************************************************************************************************************/
bool R_FWUP_IsExistImage(e_fwup_area_t area)
{
    return (check_magic_code(area));
}
/**********************************************************************************************************************
 End of function R_FWUP_IsExistImage
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_FWUP_EraseArea
 * Description  : Erasing area.
 * Arguments    : area           : FWUP_AREA_MAIN/FWUP_AREA_BUFFER
 * Return Value : FWUP_SUCCESS
 *                FWUP_ERR_FLASH
 *********************************************************************************************************************/
e_fwup_err_t R_FWUP_EraseArea(e_fwup_area_t area)
{
    return (erase_area(area));
}
/**********************************************************************************************************************
 End of function R_FWUP_EraseArea
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_FWUP_GetImageSize
 * Description  : Get image size
 * Arguments    : None
 * Return Value : 0     : calculating image size.
 *                other : image size
 *********************************************************************************************************************/
uint32_t R_FWUP_GetImageSize(void)
{
    /* Received Program list? */
    if (0 == s_prg_list_write_flg)
    {
        return (0);
    }
    return (s_image_size);
}
/**********************************************************************************************************************
 End of function R_FWUP_GetImageSize
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_FWUP_WriteImageHeader
 * Description  : Write image header.
 * Arguments    : area             : FWUP_AREA_MAIN/FWUP_AREA_BUFFER
 *                p_sig_type       : signature type
 *                p_sig            : signature
 *                sig_size         : signature size
 * Return Value : FWUP_SUCCESS
 *                FWUP_ERR_FLASH
 *                FWUP_ERR_FAILURE
 *********************************************************************************************************************/
e_fwup_err_t R_FWUP_WriteImageHeader(e_fwup_area_t area, uint8_t FWUP_FAR *p_sig_type,
                                     uint8_t FWUP_FAR *p_sig, uint32_t sig_size)
{
    uint32_t buf[FWUP_WRITE_HEADER_BUF_SIZE / sizeof(uint32_t)] = {0};
    uint8_t *p_buf_tmp = (uint8_t *)buf;
    uint32_t bufsz_tmp = sizeof (buf);
    st_fw_header_t *p_hdr = (st_fw_header_t *)buf;

    /* already exist header? */
    if (true == check_magic_code(area))
    {
        return (FWUP_SUCCESS);
    }

    if (FWUP_SIG_SIZE_MAX < sig_size)
    {
        return (FWUP_ERR_FAILURE);
    }

    /* Write to header */
    MEMCPY(p_hdr->magic_code, BOOT_LOADER_MAGIC_CODE, FWUP_MAGIC_CODE_LEN);
    p_hdr->image_flag = FWUP_IMAGE_FLAG;
    p_hdr->sig_size = sig_size;
    MEMCPY(p_hdr->sig_type, p_sig_type, STRLEN((const char FWUP_FAR *)p_sig_type));
    MEMCPY(p_hdr->sig, p_sig, sig_size);
    return (write_image_header(area, &p_buf_tmp, &bufsz_tmp, sizeof(buf)));
}
/**********************************************************************************************************************
 End of function R_FWUP_WriteImageHeader
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_FWUP_WriteImageProgram
 * Description  : write image program
 * Arguments    : area           : FWUP_AREA_MAIN/FWUP_AREA_BUFFER
 *                p_buf          : Image program
 *                buf_size       : buffer size
 * Return Value : FWUP_SUCCESS   : updated image program
 *                FWUP_PROGRESS  : need more image program data
 *                FWUP_ERR_FLASH : flash write error
 *********************************************************************************************************************/
e_fwup_err_t R_FWUP_WriteImageProgram(e_fwup_area_t area, uint8_t *p_buf, uint32_t buf_size)
{
    return (write_image_prog(area, p_buf, buf_size));
}
/**********************************************************************************************************************
 End of function R_FWUP_WriteImageProgram
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_FWUP_WriteImage
 * Description  : write image file
 * Arguments    : area       FWUP_AREA_MAIN/FWUP_AREA_BUFFER
 *                p_buf      User program data
 *                buf_size   buffer size
 * Return Value : FWUP_SUCCESS   : updated image file
 *                FWUP_PROGRESS  : need more image file data
 *                FWUP_ERR_FLASH : flash write error
 *********************************************************************************************************************/
e_fwup_err_t R_FWUP_WriteImage(e_fwup_area_t area, uint8_t *p_buf, uint32_t buf_size)
{
    uint8_t *p_buf_tmp = p_buf;
    uint32_t bufsz_tmp = buf_size;
    e_fwup_area_t area_tmp;

