renesas/iot-reference-rx/Projects/aws_ether_ck_rx65n/e2studio_ccrx/src/smc_gen/r_fwup/src/r_fwup.c
/*
 * Static functions
 */
/**********************************************************************************************************************
 * Function Name: check_initial_rcv
 * Description  : check data receiving in first time
 * Arguments    : area           : FWUP_AREA_MAIN/FWUP_AREA_BUFFER
 * Return Value : FWUP_SUCCESS
 *                FWUP_ERR_FLASH
 *********************************************************************************************************************/
static e_fwup_err_t check_initial_rcv(e_fwup_area_t area)
{
    /* Initial receiving? */
    if (0 == s_initial_rcv_flg)
    {
        /* area erase */
        if (FWUP_SUCCESS != erase_area(area))
        {
        	LogError( ("Erase area %d: NG\r\n", area) );
            return (FWUP_ERR_FLASH);
        }
        LogDebug( ("check_initial_rcv: First receiving") );
        s_initial_rcv_flg = 1;
    }
    return (FWUP_SUCCESS);
}
/**********************************************************************************************************************
 End of function check_initial_rcv
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: check_magic_code
 * Description  : check magic code on MAIN_AREA/BUFFER_AREA
 * Arguments    : area     : FWUP_AREA_MAIN/FWUP_AREA_BUFFER
 * Return Value : true     : magic code matched
 *                false    : magic code unmatched
 *********************************************************************************************************************/
static bool check_magic_code(e_fwup_area_t area)
{
    uint32_t buf[2] = {0};

    /* Compare magic_code */
    read_area(area, (uint32_t *)&buf, 0, FWUP_MAGIC_CODE_LEN);
    if (0 != MEMCMP(buf, BOOT_LOADER_MAGIC_CODE, FWUP_MAGIC_CODE_LEN))
    {
        return (false);
    }
    return (true);
}
/**********************************************************************************************************************
 End of function check_magic_code
 *********************************************************************************************************************/

/**********************************************************************************************************************
* Function Name: check_addr_range
* Description  : check addr is in range.
* Arguments    : addr  : flash address
* Return Value : true  : addr is in range.
*                false : addr is out of range.
**********************************************************************************************************************/
static bool check_addr_range(uint32_t addr)
{
    /* CF : Flash address -> install area offset */
    if (((FWUP_CFG_MAIN_AREA_ADDR_L + sizeof (st_fw_ctrlblk_t)) <= addr)
            && (addr <= (FWUP_CFG_MAIN_AREA_ADDR_L + FWUP_CFG_AREA_SIZE - 1)))
    {
        return (true);
    }

#if (FWUP_CFG_UPDATE_MODE != FWUP_SINGLE_BANK_WO_BUFFER)
    if (((FWUP_CFG_BUF_AREA_ADDR_L + sizeof (st_fw_ctrlblk_t)) <= addr)
            && (addr <= (FWUP_CFG_BUF_AREA_ADDR_L + FWUP_CFG_AREA_SIZE - 1)))
    {
        return (true);
    }
#endif /* (FWUP_CFG_UPDATE_MODE != FWUP_SINGLE_BANK_WO_BUFFER) */

    if ((0 < FWUP_DF_NUM_BLKS) &&
            (FWUP_CFG_DF_ADDR_L <= addr) && (addr < (FWUP_CFG_DF_ADDR_L + FWUP_DF_NUM_BYTES)))
    {
        return (true);
    }

    return (false);
}
/**********************************************************************************************************************
 End of function check_addr_range
 *********************************************************************************************************************/

/**********************************************************************************************************************
* Function Name: get_offset_from_install_area
* Description  : flash address into offset in area.
* Arguments    : addr : flash address
* Return Value : offset in area
**********************************************************************************************************************/
static uint32_t get_offset_from_install_area(uint32_t addr)
{
    uint32_t ret_addr = 0;

    /* CF : Flash address -> install area offset */
    if ((FWUP_CFG_MAIN_AREA_ADDR_L <= addr) && (addr <= (FWUP_CFG_MAIN_AREA_ADDR_L + FWUP_CFG_AREA_SIZE - 1)))
    {
        ret_addr = addr - FWUP_CFG_MAIN_AREA_ADDR_L;
    }
#if (FWUP_CFG_UPDATE_MODE != FWUP_SINGLE_BANK_WO_BUFFER)
    else if ((FWUP_CFG_BUF_AREA_ADDR_L <= addr) && (addr <= (FWUP_CFG_BUF_AREA_ADDR_L + FWUP_CFG_AREA_SIZE - 1)))
    {
        ret_addr = addr - FWUP_CFG_BUF_AREA_ADDR_L;
    }
    else
    {
        ; /* Do nothing */
    }
#endif /* (FWUP_CFG_UPDATE_MODE != FWUP_SINGLE_BANK_WO_BUFFER) */
    return (ret_addr);
}
/**********************************************************************************************************************
 End of function get_offset_from_install_area
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: write_image_header
 * Description  : write image header from received buffer
 * Arguments    : area           : FWUP_AREA_MAIN/FWUP_AREA_BUFFER
 *                p_buf          : Image header
 *                p_bufsz        : buffer size
 *                hdr_size       : Header size
 * Return Value : FWUP_SUCCESS   : updated image program
 *                FWUP_PROGRESS  : need more image program data
 *                FWUP_ERR_FLASH : flash error
 *********************************************************************************************************************/
static e_fwup_err_t write_image_header(e_fwup_area_t area, uint8_t **p_buf, uint32_t *p_bufsz, uint32_t hdr_size)
{
    e_fwup_err_t ret_val = FWUP_PROGRESS;

    /* Already wrote? */
    if (0 == s_img_header_write_flg)
    {
        ret_val = write_area(area, p_buf, p_bufsz, 0, hdr_size);
        if (FWUP_SUCCESS != ret_val)
        {
            return (ret_val);
        }
        s_image_size += hdr_size;
        s_img_header_write_flg = 1;
    }
    return (FWUP_SUCCESS);
}
/**********************************************************************************************************************
 End of function write_image_header
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: write_image_prog
 * Description  : write image header from received buffer
 * Arguments    : area           : FWUP_AREA_MAIN/FWUP_AREA_BUFFER
 *                p_buf          : Image program
 *                buf_size       : buffer size
 * Return Value : FWUP_SUCCESS   : updated image program
 *                FWUP_PROGRESS  : need more image program data
 *                FWUP_ERR_FLASH : flash write error
 *********************************************************************************************************************/
static e_fwup_err_t write_image_prog(e_fwup_area_t area, uint8_t *p_buf, uint32_t buf_size)
{
    e_fwup_err_t ret_val = FWUP_PROGRESS;
    uint8_t *p_buf_tmp = p_buf;
    uint32_t buf_sz_tmp = buf_size;
    st_fw_desc_t dc;
    e_fwup_area_t area_tmp = area;
    static uint8_t fw_cnt = 0;
    uint32_t area_offset;

#if (FWUP_CFG_UPDATE_MODE == FWUP_DUAL_BANK)
    area_tmp = FWUP_AREA_BUFFER;
#else
    area_tmp = area;
#endif /* (FWUP_CFG_UPDATE_MODE == FWUP_DUAL_BANK) */

    /* No buffer */
    if (0 == buf_size)
    {
        return (FWUP_PROGRESS);
    }

    if (FWUP_SUCCESS != check_initial_rcv(area_tmp))
    {
    	LogError( ("Initial receive: NG\r\n") );
        return (FWUP_ERR_FLASH);
    }

