renesas/iot-reference-rx/Projects/aws_ether_ck_rx65n/e2studio_ccrx/src/smc_gen/r_fwup/src/r_fwup.c
    /* Write descriptor */
    if (0 == s_prg_list_write_flg)
    {
        area_offset = sizeof(st_fw_header_t);
        LogDebug( ("write_image_prog: write descriptor from address %X with buffer size %d and write size %d", FWUP_BUF_AREA_ADDR_L + area_offset, buf_sz_tmp, sizeof(st_fw_desc_t)) );
        ret_val = write_area(area_tmp, &p_buf_tmp, &buf_sz_tmp, sizeof(st_fw_header_t), sizeof(st_fw_desc_t));
        if (FWUP_SUCCESS != ret_val)
        {
        	LogError( ("write_image_prog: NG, write_area to write descriptor returns %d at address %X", ret_val, FWUP_BUF_AREA_ADDR_L + area_offset) );
            return (ret_val);
        }
        s_image_size += sizeof(st_fw_desc_t);

        /* get Image size */
        read_area(area_tmp, (uint32_t *)&dc, area_offset, sizeof(st_fw_desc_t));

        for (uint32_t i = 0; i < dc.n; i++)
        {
            /* write address in range? */
            if (false == check_addr_range(dc.fw[i].addr))
            {
                erase_area(area_tmp);
                LogError( ("write_image_prog: NG, check_addr_range fails at address 0x%X of block %d\r\n", dc.fw[i].addr, i) );
                return (FWUP_ERR_FLASH);
            }
            s_image_size += dc.fw[i].size;
        }
        LogDebug( ("write_image_prog: image size = %d", s_image_size) );

        /* Write flag is on */
        s_prg_list_write_flg = 1;

        /* IS there more buffer ? */
        if (0 == buf_sz_tmp)
        {
            return (FWUP_PROGRESS);
        }
    }

    /* write user program */
    if (0 == s_img_prog_write_flg)
    {
        while(1)
        {
            /* Get N, addr, size */
            read_area(area_tmp, (uint32_t *)&dc, sizeof(st_fw_header_t), sizeof(st_fw_desc_t));
            if ((FWUP_CFG_DF_ADDR_L <= dc.fw[fw_cnt].addr) &&
                (dc.fw[fw_cnt].addr < (FWUP_CFG_DF_ADDR_L + FWUP_DF_NUM_BYTES)))
            {
                /* DF*/
            	LogDebug( ("write_image_prog: write DF") );
                area_offset = dc.fw[fw_cnt].addr - FWUP_CFG_DF_ADDR_L;
                area_tmp = FWUP_AREA_DATA_FLASH;
            }
            else
            {
            	LogDebug( ("write_image_prog: write CF at block %d", fw_cnt) );
                /* CF : Flash address -> install area offset */
                area_offset = get_offset_from_install_area(dc.fw[fw_cnt].addr);
#if (FWUP_CFG_UPDATE_MODE == FWUP_DUAL_BANK)
                area_tmp = FWUP_AREA_BUFFER;
#else
                area_tmp = area;
#endif /* (FWUP_CFG_UPDATE_MODE == FWUP_DUAL_BANK) */
            }

            LogInfo( ("write_image_prog: write_area to write userprog at address 0x%X of block %d and size %d", FWUP_BUF_AREA_ADDR_L+area_offset, fw_cnt, dc.fw[fw_cnt].size) );
            ret_val = write_area(area_tmp, &p_buf_tmp, &buf_sz_tmp, area_offset, dc.fw[fw_cnt].size);
            if (FWUP_SUCCESS != ret_val)
            {
            	LogInfo( ("write_image_prog: NG, write_area to write userprog returns %d", ret_val) );
                return (ret_val);
            }

            /* Next part */
            if (++fw_cnt >= dc.n)
            {
                s_img_prog_write_flg = 1;
                break;
            }

            /* IS there buffer to write ? */
            if (0 == buf_sz_tmp)
            {
                return (FWUP_PROGRESS);
            }
        }
    }

    if (1 == s_img_prog_write_flg)
    {
        s_image_size = 0;
        s_initial_rcv_flg = 0;
        s_img_header_write_flg = 0;
        s_prg_list_write_flg = 0;
        s_img_prog_write_flg = 0;
    }
    return (ret_val);
}
/**********************************************************************************************************************
 End of function write_image_prog
 *********************************************************************************************************************/

/**********************************************************************************************************************
* Function Name: erase_area
* Description  : Erase designated install area.
* Arguments    : area           : FWUP_AREA_MAIN/FWUP_AREA_BUFFER/FWUP_AREA_DATA_FLASH
* Return Value : FWUP_SUCCESS
*                FWUP_ERR_FLASH
**********************************************************************************************************************/
static e_fwup_err_t erase_area(e_fwup_area_t area)
{
    e_fwup_err_t (*pfunc)(uint32_t, uint32_t) = r_fwup_wrap_flash_erase;
    uint32_t addr = FWUP_CFG_MAIN_AREA_ADDR_L;
    uint32_t num_blk = (FWUP_CFG_AREA_SIZE / FWUP_CFG_CF_BLK_SIZE);

    switch(area)
    {
        case FWUP_AREA_BUFFER:
            addr = FWUP_BUF_AREA_ADDR_L;
            num_blk = FWUP_BUF_AREA_NUM_BLKS;
            pfunc = FWUP_FUNC_BUFFER_AREA_ERASE;
            break;
        case FWUP_AREA_DATA_FLASH:
            addr = FWUP_CFG_DF_ADDR_L;
            num_blk = FWUP_CFG_DF_NUM_BLKS;
            break;
        default:
            break;
    }
    return (pfunc(addr, num_blk));
}
/**********************************************************************************************************************
 End of function erase_area
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: write_area
 * Description  : Write firmware data to designated area.
 * Arguments    : area           : FWUP_AREA_MAIN/FWUP_AREA_BUFFER/FWUP_AREA_DATA_FLASH
 *                p_buf:(i/o)    : (i)image data's pointer ,  (o)left buffer
 *                p_bufsz:(i/o)  : (i)buffer size,            (o)left buffer size
 *                offset         : write offset from install area. (not flash address!!!)
 *                size           : write size
 *                left_sz        : number of not flashed data.
 * Return Value : FWUP_SUCCESS   : done     (enough buffer)
 *                FWUP_PROGRESS  : progress (not enough buffer)
 *                FWUP_ERR_FLASH : flash write error
 *********************************************************************************************************************/
static e_fwup_err_t write_area(e_fwup_area_t area, uint8_t **p_buf,
                               uint32_t *p_bufsz, uint32_t offset, uint32_t size)
{
    uint32_t start_addr = FWUP_CFG_MAIN_AREA_ADDR_L + offset;
    e_fwup_err_t (*pfunc)(uint32_t, uint32_t, uint32_t) = r_fwup_wrap_flash_write;
    uint32_t write_size_tmp;

