renesas/iot-reference-rx/Projects/aws_ether_ck_rx65n/e2studio_ccrx/src/smc_gen/r_fwup/src/r_fwup.c
    if (FWUP_AREA_BUFFER == area)
    {
        pfunc = FWUP_FUNC_BUFFER_AREA_WRITE;
        start_addr = FWUP_BUF_AREA_ADDR_L + offset;
    }
    else if (FWUP_AREA_DATA_FLASH == area)
    {
        start_addr = FWUP_CFG_DF_ADDR_L + offset;
    }
    else
    {
        ; /* Do nothing */
    }

    /* Is buffer enough? */
    if (size > (s_wrote_counter + (*p_bufsz)))
    {
        /* not enough */
        write_size_tmp = *p_bufsz;
    }
    else
    {
        /* enough */
        write_size_tmp = size - s_wrote_counter;
    }

    /* Write firmware */
    LogInfo( ("write_area: write to address %x with size=%d (0x%X)", start_addr + s_wrote_counter, write_size_tmp, write_size_tmp) );
    if (FWUP_SUCCESS != pfunc((uint32_t)*p_buf, start_addr + s_wrote_counter, write_size_tmp))
    {
    	LogError( ("write_area: flash error") );
        return (FWUP_ERR_FLASH);
    }
    FWUP_LOG_DBG(MSG_WRITE_OK, start_addr + s_wrote_counter, write_size_tmp);
    LogDebug( (MSG_WRITE_OK, start_addr + s_wrote_counter, write_size_tmp) );

    s_wrote_counter += write_size_tmp;
    *p_buf += write_size_tmp;
    *p_bufsz -= write_size_tmp;
    if (size > s_wrote_counter)
    {
    	LogDebug( ("write_area: remaining buffer size=%d, continue...", *p_bufsz) );
        return (FWUP_PROGRESS);
    }

    s_wrote_counter = 0;
    LogDebug( ("write_area: success!") );
    return (FWUP_SUCCESS);
}
/**********************************************************************************************************************
 End of function write_area
 *********************************************************************************************************************/

/**********************************************************************************************************************
* Function Name: read_area
* Description  : read data from main area / buffer area.
* Arguments    : area      : FWUP_AREA_MAIN/FWUP_AREA_BUFFER/FWUP_AREA_DATA_FLASH
*                pbuf      : buffer pointer
*                read_addr : FWUP_AREA_MAIN/FWUP_AREA_BUFFER : offset in area.
*                          : FWUP_AREA_DATA_FLASH : flash address
*                size      : read size
* Return Value : none
**********************************************************************************************************************/
static void read_area(e_fwup_area_t area, uint32_t * p_buf, uint32_t area_offset, uint32_t size)
{
    uint32_t flash_addr;
    e_fwup_err_t (*pfunc)(uint32_t, uint32_t, uint32_t) = r_fwup_wrap_flash_read;

    if (FWUP_AREA_MAIN == area)
    {
        flash_addr = area_offset + FWUP_CFG_MAIN_AREA_ADDR_L;
    }
    else if (FWUP_AREA_BUFFER == area)
    {
        pfunc = FWUP_FUNC_BUFFER_AREA_READ;
        flash_addr = area_offset + FWUP_BUF_AREA_ADDR_L;
    }
    else
    {
        /* Data flash */
        flash_addr = area_offset;
    }
    pfunc((uint32_t)p_buf, flash_addr, size);
}
/**********************************************************************************************************************
 End of function read_area
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: copy_to_main_area
 * Description  : Copy buffer area to main area
 * Arguments    : None
 * Return Value : FWUP_SUCCESS
 *                FWUP_ERR_FLASH
 *********************************************************************************************************************/
static e_fwup_err_t copy_to_main_area(void)
{
#if (FWUP_CFG_UPDATE_MODE != FWUP_DUAL_BANK) && (FWUP_CFG_UPDATE_MODE != FWUP_SINGLE_BANK_WO_BUFFER)
    uint32_t    read_addr = 0;
    int32_t     block_cnt;
    uint32_t    max_cnt;
    uint32_t    cf_block[FWUP_COPY_BUF_SIZE / sizeof(uint32_t)];

    /* Erase main area */
    if (FWUP_SUCCESS != erase_area(FWUP_AREA_MAIN))
    {
        return (FWUP_ERR_FLASH);
    }

    /* Copy to main area */
    max_cnt = (FWUP_CFG_AREA_SIZE / FWUP_COPY_BUF_SIZE);
    for (block_cnt = 0; max_cnt > block_cnt; block_cnt++)
    {
        /* Read firmware from buffer area */
        read_area(FWUP_AREA_BUFFER, cf_block, read_addr, FWUP_COPY_BUF_SIZE);

        /* Write firmware to main area */
        if (FWUP_SUCCESS !=
                r_fwup_wrap_flash_write((uint32_t) cf_block,
                                        (uint32_t) (FWUP_CFG_MAIN_AREA_ADDR_L + (FWUP_COPY_BUF_SIZE * block_cnt)),
                                        FWUP_COPY_BUF_SIZE))
        {
            return (FWUP_ERR_FLASH);
        }
        read_addr += FWUP_COPY_BUF_SIZE;
    }

    /* Erase buffer area */
    return (erase_area(FWUP_AREA_BUFFER));
#else
    return (FWUP_SUCCESS);
#endif /* (FWUP_CFG_UPDATE_MODE != FWUP_DUAL_BANK) */
}
/**********************************************************************************************************************
 End of function copy_to_main_area
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: sha256_update
 * Description  : calculate SHA256 hash of designated install area. (MAIN_AREA or BUFFER_AREA)
 * Arguments    : area        : FWUP_AREA_MAIN/FWUP_AREA_BUFFER/FWUP_AREA_DATA_FLASH
 *                vp_ctx      : crypt library's context
 *                area_offset : offset in area
 *                datalen     : data length
 * Return Value : none.
 *********************************************************************************************************************/
static int32_t sha256_update(e_fwup_area_t area, void * vp_ctx, uint32_t area_offset, uint32_t datalen)
{
    uint32_t rbuf[FWUP_READ_BUF_SIZE / sizeof(uint32_t)];
    uint32_t rbuf_size = FWUP_READ_BUF_SIZE;
    uint32_t area_offset_tmp = area_offset;

    while (datalen > 0)
    {
        if (datalen < rbuf_size)
        {
            rbuf_size = datalen;
        }

        /* Read flash */
        read_area(area, (uint32_t *)rbuf, area_offset_tmp, rbuf_size);
        r_fwup_wrap_sha256_update(vp_ctx, (C_U8_FAR *)rbuf, rbuf_size);

        area_offset_tmp += rbuf_size;
        datalen -= rbuf_size;
    }
    return (0);
}
/**********************************************************************************************************************
 End of function sha256_update
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: hash_sha256
 * Description  : calculate SHA256 hash on main area / buffer area.
 * Arguments    : area    : FWUP_AREA_MAIN/FWUP_AREA_BUFFER
 * Return Value : pointer of hash data.
 *********************************************************************************************************************/
static uint8_t * hash_sha256(e_fwup_area_t area)
{
    static uint8_t puc_hash[FWUP_HASH_BYTES];
    uint32_t area_offset;
    st_fw_desc_t dc;

    /**** Start user code ****/

    /* Add using crypt librarie's context */
    struct tc_sha256_state_struct x_ctx;

    /**** End user code   ****/

    r_fwup_wrap_sha256_init(&x_ctx);

    /* Read N, addr, size from update list */
    area_offset = sizeof(st_fw_header_t);
    read_area(area, (uint32_t *)&dc, area_offset, sizeof(st_fw_desc_t));

    /* update list */
    sha256_update(area, &x_ctx, area_offset, sizeof(st_fw_desc_t));

    /* program code */
    for (uint8_t cnt = 0; cnt < dc.n; cnt++)
    {
        if ((FWUP_CFG_DF_ADDR_L <= dc.fw[cnt].addr) && (dc.fw[cnt].addr < (FWUP_CFG_DF_ADDR_L + FWUP_DF_NUM_BYTES)))
        {
            /* Data flash */
            sha256_update(FWUP_AREA_DATA_FLASH, &x_ctx, dc.fw[cnt].addr, dc.fw[cnt].size);
        }
        else
        {
            /* Code flash */
            area_offset =  get_offset_from_install_area(dc.fw[cnt].addr);
            sha256_update(area, &x_ctx, area_offset, dc.fw[cnt].size);
        }
    }

    r_fwup_wrap_sha256_final(puc_hash, &x_ctx);

    return puc_hash;
}
/**********************************************************************************************************************
 End of function hash_sha256
 *********************************************************************************************************************/
